---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyWallError
source: html/f2b5898d-12d6-0242-97fa-1d55d1c48c2e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyWallError Property

There is a circular chain of references among the highlighted elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularDependencyWallError { get; }
```